snlkuharlocal/src/Documents/РегистрацияДисконтнойКарты/РегистрацияДисконтнойКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияДисконтнойКарты</name>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаДоИзменения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииДоИзменения</name>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОДоИзменения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>ДРДоИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДР</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТЦВыдачиДоИзменения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЦВыдачи</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СМСРассылкаДоИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СМСРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочтаРассылкаДоИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочтаРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаДКофис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕМэйлДоИзменения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕМэйл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонДоИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТЦРегистрации</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденаСтараяДК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденаНоваяДК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Акционная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БылаРанееКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ДисконтныеКарты/ДисконтныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДисконтныеКарты</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕМэйл</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонДомашний</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЦВыдачи</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникИнформации</name>
    <type>
      <types>CatalogRef.ИсточникиИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКлуба</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВступленияВКлуб</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкидкаСтарая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКлубаГП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованДР2010</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧленКлуба2012</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>СМСРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочтаРассылка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПромоКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСуммаДо2013</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ликвидирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АкционнаяДК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БылаРанееКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НомераДК</name>
    <attributes>
      <name>НомерДК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТЦРегистрации</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИспользованныеДР</name>
    <attributes>
      <name>Год</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/РегистрацияДисконтнойКарты/ObjectModule.bsl
Перем ЗаписыватьДК;

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//крохин начало 24.10.2012
	//перенесено в "ПередЗаписью"
//	Если НЕ ЗаписыватьДК Тогда Возврат КонецЕсли;
//	Если ТЦРегистрации <> ПараметрыСеанса.ЭтотУзел.Подразделение Тогда Возврат КонецЕсли;
//	Если ПустаяСтрока(НомерКарты) Тогда Возврат КонецЕсли;
//	Если ЗаявкаНаДКофис Тогда
//		Если НЕ ПодтвержденаНоваяДК ИЛИ НЕ ПодтвержденаСтараяДК Тогда
//		Возврат;	
//		КонецЕсли;
//	КонецЕсли;
//	Если ДисконтнаяКарта.Пустая() Тогда
//				ДКОбъект = Справочники.ДисконтныеКарты.СоздатьЭлемент();	
//	Иначе
//		ДКОбъект = ДисконтнаяКарта.ПолучитьОбъект();	
//	КонецЕсли;	
//	Если НЕ ПустаяСтрока(НомерДоИзменения) Тогда 
//		Если ДКОбъект.НомераДК.Количество() = 0 Тогда
//		СтрокаНомерДК = ДКОбъект.НомераДК.Добавить();
//			СтрокаНомерДК.НомерДК = НомерДоИзменения;
//			СтрокаНомерДК.ДатаНачалаДействия = ДКОбъект.ДатаВступленияВКлуб;
//			СтрокаНомерДК.ТЦРегистрации = ТЦВыдачиДоИзменения;
//		КонецЕсли;
//	КонецЕсли;
//	
//		ПараметрыОтбора = Новый Структура;
//		ПараметрыОтбора.Вставить("НомерДК", НомерКарты);
//		НайденныеСтроки = ДКОбъект.НомераДК.НайтиСтроки(ПараметрыОтбора);
//		Если НайденныеСтроки.Количество() = 0 Тогда
//			СтрокаНомерДК = ДКОбъект.НомераДК.Добавить();
//			СтрокаНомерДК.НомерДК = НомерКарты;
//			СтрокаНомерДК.ДатаНачалаДействия = Дата;
//			СтрокаНомерДК.ТЦРегистрации = ТЦРегистрации;
//		КонецЕсли;
//	ДКОбъект.Владелец = Справочники.Контрагенты.НайтиПоКоду("SSP-0019");
//	ДКОбъект.Код = НомерКарты;
//	ДКОбъект.Скидка = Скидка;
//	ДКОбъект.СкидкаСтарая = Макс(ДКОбъект.Скидка,ДКОбъект.СкидкаСтарая);
//	ДКОбъект.ИсточникИнформации = ИсточникИнформации;
//	ДКОбъект.Наименование = ФИО;
//	ДКОбъект.Фамилия = Фамилия;
//	ДКОбъект.Имя = Имя;
//	ДКОбъект.Отчество = Отчество;
//	ДКОбъект.Пол = Пол;
//	ДКОбъект.ДатаРождения = ДР;
//	ДКОбъект.ТЦВыдачи = ТЦВыдачи;
//	ДКОбъект.СМСРассылка = СМСРассылка;
//	ДКОбъект.ЭлектроннаяПочтаРассылка = ЭлектроннаяПочтаРассылка;
//	ИсхТелефон = Телефон;
//	ДКОбъект.Телефон = ФорматТелефона(ИсхТелефон);
//	ДКОбъект.ЕМэйл = ЕМэйл;
//	
//	Если ДКОбъект.ДатаВступленияВКлуб = '00010101' Тогда
//	ДКОбъект.ДатаВступленияВКлуб = Дата;
//	КонецЕсли;
//	ДКОбъект.ЧленКлуба = Истина;
//	ДКОбъект.ЧленКлуба2012 = Истина;
//	ДКОбъект.Записать();
//	Если ДисконтнаяКарта <> ДКОбъект.Ссылка Тогда
//	ДисконтнаяКарта = ДКОбъект.Ссылка;
//КонецЕсли;
//крохин конец 24.10.2012
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если НЕ ОбменДанными.Загрузка Тогда		
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);			
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
	КонецЕсли;
	
	ЕстьИзменения		=Модифицированность();	
	НужноВыгружать		=НужноВыгружатьДокумент(ЕстьИзменения,Ссылка,РежимЗаписи,ПометкаУдаления);
	Если НужноВыгружать Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	//крохин начало 24.10.2012
	//непроведенные документы не создают ДК
	//Если Ссылка.Отработано Тогда
	//ЗаписыватьДК = Ложь;
	//Иначе
	//ЗаписыватьДК = Истина;
	//КонецЕсли;
	Если ОбменДанными.Загрузка Тогда
		ЗаписыватьДК = Ложь;
	Иначе
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			ЗаписыватьДК = Истина;	
		Иначе
			Если Ссылка.Отработано И Проведен Тогда
				ЗаписыватьДК = Ложь;
			Иначе
				ЗаписыватьДК = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//крохин конец 24.10.2012
	
	//крохин начало 24.10.2012
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОбработкаЗаписиДК();	
	КонецЕсли;
	//крохин конец 24.10.2012
	
КонецПроцедуры

Процедура СканированиеСтаройДКcn(Данные,ФормаДокумента) Экспорт 
		ДК = Справочники.ДисконтныеКарты.НайтиПоКоду(Данные);
	Если ДК.Пустая() Тогда
	НомерКарты = Данные;
	Скидка = Макс(5,Скидка);
	ТЦВыдачи = ?(ТЦВыдачи.Пустая(),ПараметрыСеанса.ЭтотУзел.Подразделение,ТЦВыдачи);
    Иначе
	ДисконтнаяКарта = ДК;
	НомерДоИзменения = ДК.Код;
	СкидкаДоИзменения = Макс(ДК.Скидка,ДК.СкидкаСтарая);
	Скидка = Макс(5,СкидкаДоИзменения);
	Скидка = Макс(Скидка,ПолучитьСкидкуДК(ДК.ОбщаяСумма));
	//крохин начало 15.11.2012
	//не используется
	//Если НЕ ЗаявкаНаДКофис Тогда
	//Скидка = Мин(Скидка,15);	
	//КонецЕсли;
    //крохин конец 15.11.2012

	ИсточникИнформацииДоИзменения = ДК.ИсточникИнформации;
	ИсточникИнформации = ДК.ИсточникИнформации;
		Если НЕ ИсточникИнформации.Предопределенный Тогда
	ИсточникИнформации = ПолучитьИсточникИнформации(ИсточникИнформации);	
	КонецЕсли;

	ФИОДоИзменения = ДК.Наименование;
	ФИО = ДК.Наименование;
	ФИОслужебная = ФИО;
	Если ПустаяСтрока(Фамилия) Тогда
		Фамилия  = ВыделитьСлово(ФИОслужебная);
		Имя      = ВыделитьСлово(ФИОслужебная);
		Отчество = ВыделитьСлово(ФИОслужебная);
	КонецЕсли;
	ДРДоИзменения = ДК.ДатаРождения;
	ДР = ДК.ДатаРождения;
	ТЦВыдачиДоИзменения = ДК.ТЦВыдачи;
	ТЦВыдачи = ПараметрыСеанса.ЭтотУзел.Подразделение;
	СМСРассылкаДоИзменения = ДК.СМСРассылка;
	СМСРассылка = дк.СМСРассылка;
	ЭлектроннаяПочтаРассылкаДоИзменения = ДК.ЭлектроннаяПочтаРассылка;
	ЭлектроннаяПочтаРассылка = дк.ЭлектроннаяПочтаРассылка;
	ЕМэйлДоИзменения = ДК.ЕМэйл;
	ЕМэйл = ДК.ЕМэйл;
	Пол = ДК.Пол;
	ТЦРегистрации = ПараметрыСеанса.ЭтотУзел.Подразделение;
	
	 
    ИсхТелефон = ДК.Телефон;
	ТелефонДоИзменения = ФорматТелефона(ИсхТелефон);
	Если СтрДлина(ТелефонДоИзменения) = 10 Тогда
		Телефон = ТелефонДоИзменения;
	КонецЕсли;
КонецЕсли;

ЭлементыФормы =  ФормаДокумента.ЭлементыФормы;

Если ПустаяСтрока(НомерДоИзменения) Тогда
ЭлементыФормы.рРеквизитыДоИзменения.Видимость = Ложь;
ЭлементыФормы.НадписьНомерДоИзменения.Видимость = Ложь;
ЭлементыФормы.НомерДоИзменения.Видимость = Ложь;
ЭлементыФормы.НадписьСкидкаДоИзменения.Видимость = Ложь;
ЭлементыФормы.СкидкаДоИзменения.Видимость = Ложь;
ЭлементыФормы.ТПроцент.Видимость = Ложь;
ЭлементыФормы.НадписьИсточникИнформацииДоИзменения.Видимость = Ложь;
ЭлементыФормы.ИсточникИнформацииДоИзменения.Видимость = Ложь;
ЭлементыФормы.НадписьФИОДоИзменения.Видимость = Ложь;
ЭлементыФормы.ФИОДоИзменения.Видимость = Ложь;
ЭлементыФормы.НадписьДРДоИзменения.Видимость = Ложь;
ЭлементыФормы.ДРДоИзменения.Видимость = Ложь;
ЭлементыФормы.НадписьТелефонДоИзменения.Видимость = Ложь;
ЭлементыФормы.ТелефонДоИзменения.Видимость = Ложь;
ЭлементыФормы.НадписьТЦВыдачиДоИзменения.Видимость = Ложь;
ЭлементыФормы.ТЦВыдачиДоИзменения.Видимость = Ложь;
ЭлементыФормы.тРассылки.Видимость = Ложь;
ЭлементыФормы.СМСРассылкаДоИзменения.Видимость = Ложь;
ЭлементыФормы.ЭлектроннаяПочтаРассылкаДоИзменения.Видимость = Ложь;
ЭлементыФормы.НадписьЕМэйлДоИзменения.Видимость = Ложь;
ЭлементыФормы.ЕМэйлДоИзменения.Видимость = Ложь;
Иначе
ЭлементыФормы.рРеквизитыДоИзменения.Видимость = Истина;
ЭлементыФормы.НадписьНомерДоИзменения.Видимость = Истина;
ЭлементыФормы.НомерДоИзменения.Видимость = Истина;
ЭлементыФормы.НадписьСкидкаДоИзменения.Видимость = Истина;
ЭлементыФормы.СкидкаДоИзменения.Видимость = Истина;
ЭлементыФормы.ТПроцент.Видимость = Истина;
ЭлементыФормы.НадписьИсточникИнформацииДоИзменения.Видимость = Истина;
ЭлементыФормы.ИсточникИнформацииДоИзменения.Видимость = Истина;
ЭлементыФормы.НадписьФИОДоИзменения.Видимость = Истина;
ЭлементыФормы.ФИОДоИзменения.Видимость = Истина;
ЭлементыФормы.НадписьДРДоИзменения.Видимость = Истина;
ЭлементыФормы.ДРДоИзменения.Видимость = Истина;
ЭлементыФормы.НадписьТелефонДоИзменения.Видимость = Истина;
ЭлементыФормы.ТелефонДоИзменения.Видимость = Истина;
ЭлементыФормы.НадписьТЦВыдачиДоИзменения.Видимость = Истина;
ЭлементыФормы.ТЦВыдачиДоИзменения.Видимость = Истина;
ЭлементыФормы.тРассылки.Видимость = Истина;
ЭлементыФормы.СМСРассылкаДоИзменения.Видимость = Истина;
ЭлементыФормы.ЭлектроннаяПочтаРассылкаДоИзменения.Видимость = Истина;
ЭлементыФормы.НадписьЕМэйлДоИзменения.Видимость = Истина;
ЭлементыФормы.ЕМэйлДоИзменения.Видимость = Истина;
КонецЕсли;

//крохин начало 15.11.2012
Если ДК.ПромоКарта Тогда
НомерКарты = НомерДоИзменения;	
КонецЕсли;
//крохин конец 15.11.2012


КонецПроцедуры


//нечаева начальный процент скидки 09,10,14 +++
Процедура СканированиеСтаройДК(Данные,ФормаДокумента,АкцияПоСкидкеДК=Неопределено) Экспорт 
	
	НачальнаяСкидка = 5;
	Если НЕ АкцияПоСкидкеДК=Неопределено  Тогда
		
		Если АкцияПоСкидкеДК.СкидкаДК>5 Тогда
			
			НачальнаяСкидка = АкцияПоСкидкеДК.СкидкаДК; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	//НЕЧАЕВА 16,04,15 ++
	НачальнаяСкидка = 5;
	Если НЕ АкцияПоСкидкеДК=Неопределено  Тогда
		Если АкцияПоСкидкеДК.ИзменениеСкидокДКПроцент.Количество()>0 Тогда
			НачальнаяСкидка = ЭтотОбъект.Скидка; 
		КонецЕсли;
	КонецЕсли;
   	//НЕЧАЕВА 16,04,15 --
	
	ДК = Справочники.ДисконтныеКарты.НайтиПоКоду(Данные);
	Если ДК.Пустая() Тогда
		НомерКарты = Данные;
		Скидка = Макс(НачальнаяСкидка,Скидка);
		ТЦВыдачи = ?(ТЦВыдачи.Пустая(),ПараметрыСеанса.ЭтотУзел.Подразделение,ТЦВыдачи);
	Иначе
		ДисконтнаяКарта = ДК;
		НомерДоИзменения = ДК.Код;
		СкидкаДоИзменения = Макс(ДК.Скидка,ДК.СкидкаСтарая);
		Скидка = Макс(НачальнаяСкидка,СкидкаДоИзменения);
		Скидка = Макс(Скидка,ПолучитьСкидкуДК(ДК.ОбщаяСумма));
		//крохин начало 15.11.2012
		//не используется
		//Если НЕ ЗаявкаНаДКофис Тогда
		//Скидка = Мин(Скидка,15);	
		//КонецЕсли;
		//крохин конец 15.11.2012
		
		ИсточникИнформацииДоИзменения = ДК.ИсточникИнформации;
		ИсточникИнформации = ДК.ИсточникИнформации;
		Если НЕ ИсточникИнформации.Предопределенный Тогда
			ИсточникИнформации = ПолучитьИсточникИнформации(ИсточникИнформации);	
		КонецЕсли;
		
		ФИОДоИзменения = ДК.Наименование;
		ФИО = ДК.Наименование;
		ФИОслужебная = ФИО;
		Если ПустаяСтрока(Фамилия) Тогда
			Фамилия  = ВыделитьСлово(ФИОслужебная);
			Имя      = ВыделитьСлово(ФИОслужебная);
			Отчество = ВыделитьСлово(ФИОслужебная);
		КонецЕсли;
		ДРДоИзменения = ДК.ДатаРождения;
		ДР = ДК.ДатаРождения;
		ТЦВыдачиДоИзменения = ДК.ТЦВыдачи;
		ТЦВыдачи = ПараметрыСеанса.ЭтотУзел.Подразделение;
		СМСРассылкаДоИзменения = ДК.СМСРассылка;
		СМСРассылка = дк.СМСРассылка;
		ЭлектроннаяПочтаРассылкаДоИзменения = ДК.ЭлектроннаяПочтаРассылка;
		ЭлектроннаяПочтаРассылка = дк.ЭлектроннаяПочтаРассылка;
		ЕМэйлДоИзменения = ДК.ЕМэйл;
		ЕМэйл = ДК.ЕМэйл;
		Пол = ДК.Пол;
		ТЦРегистрации = ПараметрыСеанса.ЭтотУзел.Подразделение;
		//нечаева 14,06,17
		Акционная = ДК.АкционнаяДК;
		
		//----- нечаева 14,06,17---
		
		ИсхТелефон = ДК.Телефон;
		ТелефонДоИзменения = ФорматТелефона(ИсхТелефон);
		Если СтрДлина(ТелефонДоИзменения) = 10 Тогда
			Телефон = ТелефонДоИзменения;
		КонецЕсли;
	КонецЕсли;
	
	ЭлементыФормы =  ФормаДокумента.ЭлементыФормы;
	
	Если ПустаяСтрока(НомерДоИзменения) Тогда
		ЭлементыФормы.рРеквизитыДоИзменения.Видимость = Ложь;
		ЭлементыФормы.НадписьНомерДоИзменения.Видимость = Ложь;
		ЭлементыФормы.НомерДоИзменения.Видимость = Ложь;
		ЭлементыФормы.НадписьСкидкаДоИзменения.Видимость = Ложь;
		ЭлементыФормы.СкидкаДоИзменения.Видимость = Ложь;
		ЭлементыФормы.ТПроцент.Видимость = Ложь;
		ЭлементыФормы.НадписьИсточникИнформацииДоИзменения.Видимость = Ложь;
		ЭлементыФормы.ИсточникИнформацииДоИзменения.Видимость = Ложь;
		ЭлементыФормы.НадписьФИОДоИзменения.Видимость = Ложь;
		ЭлементыФормы.ФИОДоИзменения.Видимость = Ложь;
		ЭлементыФормы.НадписьДРДоИзменения.Видимость = Ложь;
		ЭлементыФормы.ДРДоИзменения.Видимость = Ложь;
		ЭлементыФормы.НадписьТелефонДоИзменения.Видимость = Ложь;
		ЭлементыФормы.ТелефонДоИзменения.Видимость = Ложь;
		ЭлементыФормы.НадписьТЦВыдачиДоИзменения.Видимость = Ложь;
		ЭлементыФормы.ТЦВыдачиДоИзменения.Видимость = Ложь;
		ЭлементыФормы.тРассылки.Видимость = Ложь;
		ЭлементыФормы.СМСРассылкаДоИзменения.Видимость = Ложь;
		ЭлементыФормы.ЭлектроннаяПочтаРассылкаДоИзменения.Видимость = Ложь;
		ЭлементыФормы.НадписьЕМэйлДоИзменения.Видимость = Ложь;
		ЭлементыФормы.ЕМэйлДоИзменения.Видимость = Ложь;
	Иначе
		ЭлементыФормы.рРеквизитыДоИзменения.Видимость = Истина;
		ЭлементыФормы.НадписьНомерДоИзменения.Видимость = Истина;
		ЭлементыФормы.НомерДоИзменения.Видимость = Истина;
		ЭлементыФормы.НадписьСкидкаДоИзменения.Видимость = Истина;
		ЭлементыФормы.СкидкаДоИзменения.Видимость = Истина;
		ЭлементыФормы.ТПроцент.Видимость = Истина;
		ЭлементыФормы.НадписьИсточникИнформацииДоИзменения.Видимость = Истина;
		ЭлементыФормы.ИсточникИнформацииДоИзменения.Видимость = Истина;
		ЭлементыФормы.НадписьФИОДоИзменения.Видимость = Истина;
		ЭлементыФормы.ФИОДоИзменения.Видимость = Истина;
		ЭлементыФормы.НадписьДРДоИзменения.Видимость = Истина;
		ЭлементыФормы.ДРДоИзменения.Видимость = Истина;
		ЭлементыФормы.НадписьТелефонДоИзменения.Видимость = Истина;
		ЭлементыФормы.ТелефонДоИзменения.Видимость = Истина;
		ЭлементыФормы.НадписьТЦВыдачиДоИзменения.Видимость = Истина;
		ЭлементыФормы.ТЦВыдачиДоИзменения.Видимость = Истина;
		ЭлементыФормы.тРассылки.Видимость = Истина;
		ЭлементыФормы.СМСРассылкаДоИзменения.Видимость = Истина;
		ЭлементыФормы.ЭлектроннаяПочтаРассылкаДоИзменения.Видимость = Истина;
		ЭлементыФормы.НадписьЕМэйлДоИзменения.Видимость = Истина;
		ЭлементыФормы.ЕМэйлДоИзменения.Видимость = Истина;
	КонецЕсли;
	
	//крохин начало 15.11.2012
	Если ДК.ПромоКарта Тогда
		НомерКарты = НомерДоИзменения;	
	КонецЕсли;
	//крохин конец 15.11.2012
	
	
КонецПроцедуры
//нечаева начальный процент скидки 09,10,14 ---


Функция ВыделитьСлово(ИсходнаяСтрока)
	
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
	
КонецФункции



Функция ПолучитьИсточникИнформации(Источник) Экспорт
	Если Источник.Пустая() Тогда
	Возврат Справочники.ИсточникиИнформации.ПустаяСсылка();		
    КонецЕсли;
    //крохин начало 24.10.2012
	//временно вводим 2 непредопределенных
	//крохин начало 25.01.2015
	
	Если СокрЛП(Источник.Код) = "11"  ИЛИ СокрЛП(Источник.Код) = "12" 	Тогда
	//крохин конец 25.01.2015	
	Возврат Источник;	
	КонецЕсли;
	//крохн конец 24.10.2012
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсточникиИнформации.Ссылка
	               |ИЗ
	               |	Справочник.ИсточникиИнформации КАК ИсточникиИнформации
	               |ГДЕ
	               |	ИсточникиИнформации.Наименование ПОДОБНО &Наименование
	               |	И ИсточникиИнформации.Предопределенный";
				   Запрос.УстановитьПараметр("Наименование","%"+Источник.Наименование+"%");
				   Выборка = Запрос.Выполнить().Выбрать();
				   Если Выборка.Следующий() Тогда
					   Возврат Выборка.Ссылка;
				   Иначе
					   Возврат Справочники.ИсточникиИнформации.ПустаяСсылка();	
				   КонецЕсли; 
	
	
	
   КонецФункции


	   
  
Функция ФорматТелефона(ИсхТелефон) Экспорт
	ИсхТелефон = СтрЗаменить(ИсхТелефон,"(","");
	ИсхТелефон = СтрЗаменить(ИсхТелефон,")","");
	ИсхТелефон = СтрЗаменить(ИсхТелефон,"-","");
	Если СтрДлина(ИсхТелефон) = 10 Тогда
			Возврат ИсхТелефон;
		Иначеесли СтрДлина(ИсхТелефон) = 11 Тогда
			Возврат Прав(ИсхТелефон,10);
		иначе
			Возврат ИсхТелефон;
		КонецЕсли;
	КонецФункции

	Процедура ПриКопировании(ОбъектКопирования)
		ДисконтнаяКарта = Неопределено;
		НомерДоИзменения = Неопределено;
		НомерКарты = Неопределено;
		СкидкаДоИзменения = Неопределено;
		Скидка = Неопределено;
		ИсточникИнформацииДоИзменения = Неопределено;
		ИсточникИнформации = Неопределено;
		ФИОДоИзменения = Неопределено;
		ФИО = Неопределено;
		Фамилия = Неопределено;
		Имя = Неопределено;
		Отчество = Неопределено;
		Пол = Неопределено;
		ДРДоИзменения = Неопределено;
		ДР = Неопределено;
		ТЦВыдачиДоИзменения = Неопределено;
		ТЦВыдачи = Неопределено;
		СМСРассылкаДоИзменения = Неопределено;
		СМСРассылка = Неопределено;
		ЭлектроннаяПочтаРассылкаДоИзменения = Неопределено;
		ЭлектроннаяПочтаРассылка = Неопределено;
		Отработано = Неопределено;
		ЗаявкаНаДКофис = Неопределено;
		ЕМэйлДоИзменения = Неопределено;
		ЕМэйл = Неопределено;
		ТелефонДоИзменения = Неопределено;
		Телефон = Неопределено;
		ТЦРегистрации = Неопределено;
		ПодтвержденаСтараяДК = Неопределено;
		ПодтвержденаНоваяДК = Неопределено;
		//нечаева 14,06,17++
		Акционная = Истина;
		//нечаева 29,01,18++
		ДатаОкончанияДействия = Дата(2018,12,31);
		//нечаева 29,01,18--
		//нечаева 14,06,17--
		
	КонецПроцедуры

	Процедура  ОбработкаЗаписиДК()  Экспорт

	Если НЕ ЗаписыватьДК Тогда Возврат КонецЕсли;
		//крохин начало 24.10.2012
		//в офисе правятся ДК любых ТЦ
		//Если ТЦРегистрации <> ПараметрыСеанса.ЭтотУзел.Подразделение Тогда Возврат КонецЕсли;
		Если ТЦРегистрации <> ПараметрыСеанса.ЭтотУзел.Подразделение Тогда
			Если ПараметрыСеанса.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			Возврат ;
			КонецЕсли;
		КонецЕсли;
		//крохин конец 24.10.2012
	Если ПустаяСтрока(НомерКарты) Тогда Возврат КонецЕсли;
	Если ЗаявкаНаДКофис Тогда
		Если НЕ ПодтвержденаНоваяДК ИЛИ НЕ ПодтвержденаСтараяДК Тогда
		Возврат;	
		КонецЕсли;
	КонецЕсли;
	Если ДисконтнаяКарта.Пустая() Тогда
				ДКОбъект = Справочники.ДисконтныеКарты.СоздатьЭлемент();	
	Иначе
		ДКОбъект = ДисконтнаяКарта.ПолучитьОбъект();	
	КонецЕсли;	
	//крохин начало 30.01.2013
	
	//крохин конец 30.01.2013
	Если НЕ ПустаяСтрока(НомерДоИзменения) Тогда 
		Если ДКОбъект.НомераДК.Количество() = 0 Тогда
		СтрокаНомерДК = ДКОбъект.НомераДК.Добавить();
			СтрокаНомерДК.НомерДК = НомерДоИзменения;
			СтрокаНомерДК.ДатаНачалаДействия = ДКОбъект.ДатаВступленияВКлуб;
			СтрокаНомерДК.ТЦРегистрации = ТЦВыдачиДоИзменения;
		КонецЕсли;
	КонецЕсли;
	    
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("НомерДК", НомерКарты);
		НайденныеСтроки = ДКОбъект.НомераДК.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаНомерДК = ДКОбъект.НомераДК.Добавить();
			СтрокаНомерДК.НомерДК = НомерКарты;
			СтрокаНомерДК.ДатаНачалаДействия = Дата;
			СтрокаНомерДК.ТЦРегистрации = ТЦРегистрации;
			//крохин начало 30.01.2013
			//запретим менять номер ДК, если уже меняли
			МенятьНомерДК = Истина;
		Иначе
			МенятьНомерДК = Ложь;
			//крохин конец 30.01.2013
		КонецЕсли;
	ДКОбъект.Владелец = Справочники.Контрагенты.НайтиПоКоду("SSP-0019");
	//крохин начало 30.01.2013
	//запретим менять номер ДК, если уже меняли
	//ДКОбъект.Код = НомерКарты;
	Если МенятьНомерДК Тогда
	ДКОбъект.Код = НомерКарты;	
	КонецЕсли;
	//крохин конец 30.01.2013
	//крохин начало 30.01.2013
	//запретим уменьшать скидку 
	//ДКОбъект.Скидка = Скидка;
	ДКОбъект.Скидка = Макс(ДКОбъект.Скидка,Скидка);
	//крохин конец 30.01.2013
	ДКОбъект.СкидкаСтарая = Макс(ДКОбъект.Скидка,ДКОбъект.СкидкаСтарая);
	ДКОбъект.ИсточникИнформации = ИсточникИнформации;
	ДКОбъект.Наименование = ФИО;
	ДКОбъект.Фамилия = Фамилия;
	ДКОбъект.Имя = Имя;
	ДКОбъект.Отчество = Отчество;
	ДКОбъект.Пол = Пол;
	ДКОбъект.ДатаРождения = ДР;
	ДКОбъект.ТЦВыдачи = ТЦВыдачи;
	ДКОбъект.СМСРассылка = СМСРассылка;
	ДКОбъект.ЭлектроннаяПочтаРассылка = ЭлектроннаяПочтаРассылка;
	ИсхТелефон = Телефон;
	ДКОбъект.Телефон = ФорматТелефона(ИсхТелефон);
	ДКОбъект.ЕМэйл = ЕМэйл;
	//нечаева 14,06,17+++
	ДКОбъект.АкционнаяДК =  Акционная;
	ДКОбъект.ДатаОкончанияДействия = ДатаОкончанияДействия;
	//нечаева 03,07,17 +++
	ДКОбъект.БылаРанееКарта = БылаРанееКарта;
	//нечаева 03,07,17 ---
	
	//нечаева 14,06,17---
	
	
	Если ДКОбъект.ДатаВступленияВКлуб = '00010101' Тогда
		ДКОбъект.ДатаВступленияВКлуб = Дата;
	КонецЕсли;
	ДКОбъект.ЧленКлуба = Истина;
	ДКОбъект.ЧленКлуба2012 = Истина;
	//крохин начало 15.11.2012
	ДКОбъект.ПромоКарта = Ложь;
	//крохин конец 15.11.2012
	ДКОбъект.Записать();
	Если ДисконтнаяКарта <> ДКОбъект.Ссылка Тогда
		ДисконтнаяКарта = ДКОбъект.Ссылка;
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
КонецПроцедуры
